Name:	
Version: 
Release: 
Summary:	Qihoo Cloudops

License:	GPL
Autoreq:	no
#Requires:	Qihoo-lockf
%description

%pre
if [ "$1" = "1" ] #安装之前的操作
then
	:
fi

%post
if [ "$1" = "1" ] #全新安装
then
	/bin/chown -R cloud:cloud /home/s
fi

if [ "$1" = "2" ] #升级安装-1
then
	:
fi

%preun
if [ "$1" = "0" ] #包卸载文件删除之前的动作处理
then
	:
fi

%files
%defattr(-,root,root,-)
#/etc/init.d/nrped_monitor
#/home/s/apps/CloudSafeLine/monitor
#%config(noreplace)

/home/s/safe

###################################
#这里是在安装期间传递的实际值：
#运行新包的 %pre (1)
#安装新文件
#运行新包的 %post (1)

#这里是在升级期间传递的值：
#运行新包的 %pre (2)
#安装新文件
#运行新包的 %post (2)
#运行旧包的 %preun (1)
#删除新文件未覆盖的任何旧文件
#运行旧包的 %postun (1)

#这里是在删除期间传递的值：
#运行旧包的 %preun (0)
#删除文件
#运行旧包的 %postun (0)
###################################

#---------------------------------------------------------------------------------------------------------------------------------------
#文件标识				在RPM升级包中是否更新了？	旧版本文件未被用户编辑过	旧版本文件被用户编辑过
#---------------------------------------------------------------------------------------------------------------------------------------
#默认					No				用新文件覆盖			用新文件覆盖
#					Yes				用新文件覆盖			用新文件覆盖
#---------------------------------------------------------------------------------------------------------------------------------------
#%config				No				用新文件覆盖			保持旧文件
#					Yes				用新文件覆盖			旧文件改名为.rpmsave并复制新文件
#---------------------------------------------------------------------------------------------------------------------------------------
#%config(noreplace)			No				用新文件覆盖			保持旧文件
#					Yes				用新文件覆盖			保持旧文件，新文件安装为.rpmnew
#---------------------------------------------------------------------------------------------------------------------------------------
#文件标识				在RPM升级包中是否更新了？	旧版本文件被用户编辑过
#-------------------------------------------------------------------------------------------------------
#由%config(noreplace)改为%config	Yes				旧文件改名为.rpmsave并安装新文件
#由%config改为%config(noreplace)	Yes				保持旧文件，新文件安装为.rpmnew
#-------------------------------------------------------------------------------------------------------
